from string_base import str1, str2, str11, str12, str21, str22

# 문자열(str) 처리 예: 생성
# ㄱ)
print("ㄱ) 작은따옴표(') str1:", str1)

# ㄴ)
print('ㄴ) 큰따옴표(") str2:', str2)

# ㄷ)
print('ㄷ) 여러 줄(문단) {큰따옴표 3개} str11:', str11)

# ㄹ)
print('ㄹ) 여러 줄(문단) {작은따옴표 3개} str12:', str12)

# ㅁ)
print('ㅁ) str22:', str22)


'''
처리 결과:
=============================
ㄱ) 작은따옴표(') str1: 안녕하세요 1
ㄴ) 큰따옴표(") str2: 안녕하세요 2
ㄷ) 여러 줄(문단) {큰따옴표 3개} str11: 
안녕하세요.
'파이썬'은 대단한 프로그래밍 언어입니다.
그래서 파이썬을 공부합니다.

ㄹ) 여러 줄(문단) {작은따옴표 3개} str12: 
그렇지만 배우기 쉽다고 무조건 좋은 것은 아닙니다.
단순함 때문에 모호하게 동작할 때가 있습니다.

ㅁ) str22: 123


'''


