from list_base import hglist1
# 목록(list) 처리 예: 추가
# ㄱ)
hglist1.append('첫소리')
print('ㄱ)', hglist1)
# ㄴ)
hglist1.insert(3, '받침')
print('ㄴ)', hglist1)
print("ㄴ) '받침' 인덱스:", hglist1.index('받침'))
# ㄷ)
hglist1.insert(21, '키위새') # 인덱스 범위 초과 지정
print('ㄷ)', hglist1)
print("ㄷ) '키위새' 인덱스:", hglist1.index('키위새'))
# ㄹ)
hglist1.insert(-3, '돌고래') # 뒤에서 3번째에 추가
print('ㄹ)', hglist1)
print("ㄹ) '돌고래' 인덱스:", hglist1.index('돌고래'))
# ㅁ)
hglist1.insert(-31, '타이티')
print('ㅁ)', hglist1)
print("ㅁ) '타이티' 인덱스:", hglist1.index('타이티'))

'''
처리 결과:
=========================
ㄱ) ['조사', '흙', '값', '형태', '여덟', '체언', '첫소리']
ㄴ) ['조사', '흙', '값', '받침', '형태', '여덟', '체언', '첫소리']
ㄴ) '받침' 인덱스: 3
ㄷ) ['조사', '흙', '값', '받침', '형태', '여덟', '체언', '첫소리', '키위새']
ㄷ) '키위새' 인덱스: 8
ㄹ) ['조사', '흙', '값', '받침', '형태', '여덟', '돌고래', '체언', '첫소리', '키위새']
ㄹ) '돌고래' 인덱스: 6
ㅁ) ['타이티', '조사', '흙', '값', '받침', '형태', '여덟', '돌고래', '체언', '첫소리', '키위새']
ㅁ) '타이티' 인덱스: 0

'''
