# 집합(set) 처리 예: 생성
# ㄱ) 중괄호 생성
from set_base import hgset1
print('ㄱ) hgset1:', hgset1)
# ㄴ) 중복 항목
hgset11 = {'참새', '비둘기', '까치', '오리', '까치', '까치', '까치'} # 중복 상태
print('ㄴ) hgset11:', hgset11)
# ㄷ) set() 생성자: 목록
hgset21 = set(['호랑이', '곰', '늑대', '여우'])
print('ㄷ) hgset21:', hgset21)
# ㄹ) set() 생성자: 튜플
hgset22 = set(('호랑이', '곰', '늑대', '여우'))
print('ㄹ) hgset22:', hgset22)
# ㅁ) set(str) 생성자: 문자열
hgset23 = set('호랑이')
print('ㅁ) hgset23:', hgset23)
# ㅂ) set({,,,}) 생성자: 집합
hgset24 = set({'서울', '뉴델리', '런던'})
print('ㅂ) hgset24:', hgset24)
# ㅅ) set({,,,}) 생성자: 사전
hgset25 = set({'한국':'서울', '인도':'뉴델리', '영국':'런던'})
print('ㅅ) hgset25:', hgset25)


'''

처리 결과:
=========================
ㄱ) hgset1: {'참새', '비둘기', '닭', '까치', '오리'}
ㄴ) hgset11: {'까치', '참새', '비둘기', '오리'}
ㄷ) hgset21: {'호랑이', '곰', '여우', '늑대'}
ㄹ) hgset22: {'호랑이', '곰', '여우', '늑대'}
ㅁ) hgset23: {'랑', '이', '호'}
ㅂ) hgset24: {'뉴델리', '서울', '런던'}
ㅅ) hgset25: {'한국', '영국', '인도'}


'''

