from pathlib import Path
filename1 = Path("./../testtext/hgcode/test1.txt");
encoding='euc-kr'
#----------
#----------
import hgsysinc
from hgwordlist import GetKeywordList_File
#---------- keyword sort
#---------- keyword sort
#=KeywordList = GetKeywordList_File(filename1, encoding, PrintTextFlag=True)
KeywordList = GetKeywordList_File(filename1, encoding)
KeywordList.sort() # sort by abc -> xyz
print('KeywordList num:', len(KeywordList))
print(KeywordList)


'''
처리 결과:
===========================================
KeywordList num: 173
['10cm의', '15도까지', '18.6도까지', '1월', '1일이라서', '26cm의', '5에서', '9.5도까지', 'KBS', '가장', '강추위', '강추위로', '거리로', '거리의', '것으로', '겨울', '겨울바람이', '계속', '곳이', '그', '기록했습니다', '기분', '기상전문기자가', '기온은', '기온은', '기온을', '끌어내렸습니다', '나온', '나왔는데', '날리는', '날씨가', '날씨가', '낮기온이', '낮부터', '낮은', '내려갔고', '내일', '내일부터', '내일부터는', '내일부터는', '너무', '누그러질', '누그러질', '눈', '눈구름의', '눈발이', '눈발이', '눈이', '눈이', '뉴스', '단단히', '당분간은', '대관령의', '대륙고기압이', '대설특보와', '대전시', '대체로', '더', '들어', '들어가고', '듯', '떨어졌습니다', '뚝', '만들어진', '많은', '맑은', '매서운', '매서운', '머물러', '모자까지', '모처럼', '목도리와', '몸이', '밖의', '밤', '보입니다', '빨리', '사흘째', '산간지역엔', '상암동', '새해', '새해', '새해', '새해', '서울도', '서울시', '서해상에서', '서해안지역도', '세찬', '손도', '시리고', '시리고', '시민들은', '시작되는', '시작했습니다', '싶어요', '쌓였는데', '아침', '안에', '약화되고', '얼굴도', '여미고', '영상으로', '영하', '영하', '영하', '영하권에', '영향으로', '예보없이', '오늘', '오늘', '오르겠습니다', '오전까지', '올', '옷깃을', '왔고', '우리나라까지', '움츠러듭니다', '월평동', '이어졌습니다', '이어졌습니다', '이어질', '이후', '있겠고', '있어서', '장갑', '적설량을', '전국의', '전망입니다', '전북', '전해드립니다', '절로', '점차', '정읍엔', '제주', '제주', '제주도엔', '조금', '조금', '좋게', '중부지방의', '지방엔', '집에가려고요', '차가운', '찬', '챙겨보지만', '첫', '첫날', '첫날', '첫날부터', '추워서', '추위나', '추위는', '추위에', '출근이', '큰', '큰', '풀린다고', '하지만', '한낮에도', '한파가', '한파와', '함께', '함께', '합니다', '호남', '호남과', '호남지방과', '확장했던']

'''

