import hgsysinc
from hgfind_ngram_test import TestNGramDict_KBDJamo
from hgtest_ext_kbs import load_kbs_16_and_trans_ngram
#-----------------------
#-----------------------
ngram_k = 5
Vocabulary, NGramVocabulary = load_kbs_16_and_trans_ngram(NGram=ngram_k)
#-----------------------------
#-----------------------------
#=ngram_k = 5
FindWord = '란국' # '한국'의 철자 오류 입력
TestNGramDict_KBDJamo(NGramVocabulary, FindWord, ngram_k)

'''
출력 결과:
-----------------------------------
Dict Num: 413165
NGram Dict Num: 4125348

편집 거리 계산
# 편집용 코드
EditDistanceCount: 1137
MinDistance_NGramWord: 


편집 거리 정렬
순서: key([word, distance, freq])
1:  ㄴㅏㄴㄱㅜㄱ(['난국', 1, 121])
2:  ㄷㅏㄴㄱㅜㄱ(['단국', 1, 2])
3:  ㅁㅏㄴㄱㅜㄱ(['만국', 1, 16])
4:  ㅇㅏㄴㄱㅜㄱ(['안국', 1, 9])
5:  ㅍㅏㄴㄱㅜㄱ(['판국', 1, 9])
6:  ㅎㅏㄴㄱㅜㄱ(['한국', 1, 26326])
7:  ㅌㅗㄹㅏㄴㄱㅜㄱ(['토란국', 2, 1])
8:  ㄱㅗㅏㄴㄱㅜㄱ(['관국', 2, 1])
9:  ㅎㅗㅏㄴㄱㅜㄱ(['환국', 2, 5])
10:  ㄹㅏㄴㄱㅜㅓㅈㅡ(['란궈즈', 3, 1])
:
:
:
1127:  ㅎㅏㄴㄱㅜㄱㅅㅏㄱㅛㄱㅗㅏㅅㅓㄱㅜㄱㅈㅓㅇㅎㅗㅏㅈㅓㅈㅣㄴㅔㅌㅡㅇㅜㅓㅋㅡ(['한국사교과서국정화저지네트워크', 32, 1])
1128:  ㅎㅏㄴㄱㅜㄱㄴㅗㄷㅗㅇㅇㅕㄴㄱㅜㅇㅜㅓㄴㅅㅓㄱㅈㅗㅏㅇㅕㄴㄱㅜㅇㅜㅣㅇㅜㅓㄴ(['한국노동연구원석좌연구위원', 33, 1])
1129:  ㅎㅏㄴㄱㅜㄱㅎㅏㄱㅈㅜㅇㅇㅏㅇㅇㅕㄴㄱㅜㅇㅜㅓㄴㅈㅏㅇㅅㅓㄱㅏㄱㅅㅣㄹㅈㅏㅇ(['한국학중앙연구원장서각실장', 33, 1])
1130:  ㅎㅏㄴㄱㅜㄱㅎㅏㄱㅈㅜㅇㅇㅏㅇㅇㅕㄴㄱㅜㅇㅜㅓㄴㅈㅏㅇㅅㅓㄱㅏㄱㄱㅗㅏㄴㅈㅏㅇ(['한국학중앙연구원장서각관장', 34, 1])
1131:  ㅎㅏㄴㄱㅜㄱㄱㅓㄴㅅㅓㄹㅅㅐㅇㅎㅗㅏㄹㅎㅗㅏㄴㄱㅕㅇㅅㅣㅎㅓㅁㅇㅕㄴㄱㅜㅇㅜㅓㄴ(['한국건설생활환경시험연구원', 35, 10])


'''




