import hgsysinc
from hgfind_ngram_test import TestNGramDict_KBDJamo
from hgtest_ext_kbs import load_kbs_16_and_trans_ngram
#-----------------------
#-----------------------
ngram_k = 5
Vocabulary, NGramVocabulary = load_kbs_16_and_trans_ngram(NGram=ngram_k)
#-----------------------------
#-----------------------------
#=FindWord = '란국경ㅈ' # '한국경ㅈ'의 철자 오류 입력
FindWord = '란국' # '한국'의 철자 오류 입력
#=FindWord = '란국경ㅂ' # '한국경제'의 철자 오류 입력
#=FindWord = '란국방송' # '한국방송'의 철자 오류 입력
#=ngram_k = 5
#-----------------------------'
# (SpellCheckMode=True) 상태이면 가장 가까운 것만 출력하기 때문에 
# 나머지 목록을 볼 수 없다. 나머지 목록도 출력하려면 (SpellCheckMode=False) 상태로 
# 바꿔야 한다.
#-----------------------------
TestNGramDict_KBDJamo(NGramVocabulary, FindWord, ngram_k, SpellCheckMode=True)


'''
출력 결과:

-----------------------------------
@@@ 철자 교정 테스트
-----------------------------------
-----------------------------------
이 예제는 [KBS 9시 뉴스(16년치)] 사전 목록을 사용한다.
[KBS 9시 뉴스(16년치)] 사전을 N그램(N=5) 사전으로 변환하여 N그램 추천

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Dict Num: 413165
NGram Dict Num: 4125348

편집 거리 계산: 검색어랑 편집 거리가 가까운 단어만 선택

{'ㄴㅏㄴㄱㅜㄱ': ['난국', 1, 121], 'ㄷㅏㄴㄱㅜㄱ': ['단국', 1, 2], 'ㅁㅏㄴㄱㅜㄱ': ['만국', 1, 16], 'ㅇㅏㄴㄱㅜㄱ': ['안국', 1, 9], 'ㅍㅏㄴㄱㅜㄱ': ['판국', 1, 9], 'ㅎㅏㄴㄱㅜㄱ': ['한국', 1, 26326]}


#--------------------
#--------------------
가중치(빈도) 정렬
순서: key([word, distance, freq])
1:  ㅎㅏㄴㄱㅜㄱ(['한국', 1, 26326])
2:  ㄴㅏㄴㄱㅜㄱ(['난국', 1, 121])
3:  ㅁㅏㄴㄱㅜㄱ(['만국', 1, 16])
4:  ㅇㅏㄴㄱㅜㄱ(['안국', 1, 9])
5:  ㅍㅏㄴㄱㅜㄱ(['판국', 1, 9])
6:  ㄷㅏㄴㄱㅜㄱ(['단국', 1, 2])
<란국> 이 단어가 맞나요? ===> 한국


'''




