# 정렬(sort) 처리 예:

wordlist101 = ['조사', '다람쥐', '흙', '값', '형태', '여덟', '체언', '갈매기', '하와이', '용언']

tuple21 = ('김치냉장고', '김치전', '김치', '김치볶음밥', '김치찌게')

dict1 = {'장르':'소설', '저자':'허균', '시대':'조선', '제목':'홍길동'}

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#@@@@@ {kimchi_dict} 변수는 {sort_base.py}와 {compre_base.py}에 
#@@@@@ 동시에 선언되었으므로 변경할 경우에 신경 써야 한다.
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# '김치'로 시작하는 단어 빈도 사전
kimchi_dict ={'김치지수':2, '김치냉장고':82, '김치유산균':16, '김치국':1, '김치전':3, 
    '김치제조업체':13, '김치':1578, '김치볶음밥':9, '김치찌게':5, '김치업체':12,
    '김치전골':1, '김치비빔국수':1, '김치파동':38, '김치찌개':38, '김치축제':5, '김치공장':40, 
    '김치독':3, '김치맛':28, '김치시장':15, '김치담그기':18, '김치양념':5, '김치코너':2,
}

def revlen(i):
    return -(len(i)) # 길이를 음수로 반환
