# 문자열(str) 처리 예:
str1 = '안녕하세요 1'
str2 = "안녕하세요 2"
str3 = "파이썬"

str11 = """
안녕하세요.
'파이썬'은 대단한 프로그래밍 언어입니다.
그래서 파이썬을 공부합니다.
"""

str12 = '''
그렇지만 배우기 쉽다고 무조건 좋은 것은 아닙니다.
단순함 때문에 모호하게 동작할 때가 있습니다.
'''

str21 = str('제주도')
str22 = str(123)

str30 = "대한민국"
str30_jamo = "대한민국" # 자모 문자열(편집기에서 구분 안 됨)
str30_jamo_fill = "ᄃᅠᅟᅢᄒᅠᅟᅡᅟᅠᆫᄆᅠᅟᅵᅟᅠᆫᄀᅠᅟᅮᅟᅠᆨ" # 채움문자로 자모 문자열

str31 = "아름다운 대한민국"
str32 = "아름다운 대한민국의 수도는 서울이다."
str33 = "원더풀 제주도"
str34 = "파이썬은 대단한 프로그래밍 언어입니다."

str41 = "아름다운 대한민국 아름다운 코리아"

str50 = "@@@아름다운 대한민국###"
str51 = "   아름다운 대한민국   "
str52 = "   그래서 파이썬을 공부합니다.   "

str61 = '문장의 각 단어는 띄어 씀을 원칙으로 한다'

str71 = '''
불휘기픈남ᄀᆞᆫ ᄇᆞᄅᆞ매아니뮐ᄊᆡ。곶됴코 여름하ᄂᆞ니
ᄉᆡ미기픈므른 ᄀᆞᄆᆞ래아니그츨ᄊᆡ。내히 이러 바ᄅᆞ래가ᄂᆞ니
'''


str81 = "Korea Seoul"
str82 = "bts kbs"
str83 = "Korea Seoul bts kbs"

str91 = "\n안녕하세요.\n'파이썬'은 대단한 프로그래밍 언어입니다.\n그래서 파이썬을 공부합니다."
str92 = "대한민국=코리아=한국=KOREA=韓國"

str102 = """동해물과 백두산이 마르고 닳도록 하느님이 보우하사 우리나라 만세.
무궁화 삼천리 화려 강산 대한 사람, 대한으로 길이 보전하세.

남산 위에 저 소나무, 철갑을 두른 듯 바람 서리 불변함은 우리 기상일세.
무궁화 삼천리 화려 강산 대한 사람, 대한으로 길이 보전하세.

가을 하늘 공활한데 높고 구름 없이 밝은 달은 우리 가슴 일편단심일세.
무궁화 삼천리 화려 강산 대한 사람, 대한으로 길이 보전하세.

이 기상과 이 맘으로 충성을 다하여 괴로우나 즐거우나 나라 사랑하세.
무궁화 삼천리 화려 강산 대한 사람, 대한으로 길이 보전하세.""" # https://ko.wikipedia.org/wiki/%EB%8C%80%ED%95%9C%EB%AF%BC%EA%B5%AD%EC%9D%98_%EA%B5%AD%EA%B0%80


#==========
str200 = ""
str201 = 'a'

str202_e1 = 'ʧipmʌŋk' # 영어(chipmunk:다람쥐)의 발음 기호
str202_e1up = 'ʧIPMɅŊK' # 'ʧipmʌŋk'를 대문자로 변환
str202_s1 = 'español' # 스페인어: 스페인어
str202_d1 = 'Tschüss' # 독일어
str202_d2 = 'außerhalb' # 독일어
str202_d3 = 'läuten' # 독일어: 종을 울리다.
str202_f1 = 'fâcheux' # 프랑스어: 속상하다
str202_f2 = 'maɲifik' # 프랑스어(magnifique)의 발음 기호
str202_j1 = 'サッポ' # 일본어: 삿포르
str202_r1 = 'Одесса' # 러이사어: 오데사
str202_sd1 = 'Tjåkkå' # 스웨덴어: 감사하다
str202_k1 = '한국'
str202_c1 = '中國'

str211 = '123'

str212 = '-1'
str221 = 'a1'
