#===========================================
# src: https://ko.wikipedia.org/wiki/%EB%8C%80%ED%95%9C%EB%AF%BC%EA%B5%AD%EC%9D%98_%EA%B5%AD%EA%B0%80
#===========================================
# 애국가
korean_nation_000 = '''
동해 물과 백두산이 마르고 닳도록 하느님이 보우하사 우리나라 만세.
남산 위에 저 소나무, 철갑을 두른 듯 바람 서리 불변함은 우리 기상일세.
가을 하늘 공활한데 높고 구름 없이 밝은 달은 우리 가슴 일편단심일세.
이 기상과 이 맘으로 충성을 다하여 괴로우나 즐거우나 나라 사랑하세.

무궁화 삼천리 화려 강산 대한 사람, 대한으로 길이 보전하세.
'''
애국가 = korean_nation_000

korean_nation_001 = '''
동해 물과 백두산이 마르고 닳도록 하느님이 보우하사 우리나라 만세.
'''
애국가1 = korean_nation_001

korean_nation_000_b = '동해 물과 백두산이 마르고 닳도록 ... 대한으로 길이 보전하세.'  # 편집용 약식 내용

#-------------------- 
# 역파일 색인은 위한 간단한 텍스트
#--------------------
_ex_news_1_ = "kbs, 날씨, 바람, 추위, 온도, 영하"
_ex_news_2_ = "kbs, 날씨, 영상, 포근한, 풀리다"
_ex_news_3_ = "날씨, 강추위, 추위, 얼음, 바람, 영하"
_ex_news_4_ = "kbs, 비바람, 추위, 내일, 쌀쌀하다,"
